def numnum(num: int):
    list = []
    total = 0
    
    for i in range(1, num + 1):
        name = input(f'ชื่อพนักงานคนที่{i}: ')
        ยอดขาย = int(input(f'ยอดขายของ{name}: '))
        if ยอดขาย >= 70:
            ผลงาน = "ดีเยี่ยม"
        elif ยอดขาย >= 50:
            ผลงาน = 'ปลานกลาง'
        else:
            ผลงาน = 'แย่'
        dict_ = {
            "name": name,
            "ยอดขาย": ยอดขาย,
            "ผลงาน": ผลงาน
        }
        list.append(dict_)
        total += ยอดขาย

    print("====================================")
    print(f'"--------------------------", \n"       สรุปผลการทำงาน", \n "--------------------------"')
    print(f"{'ชื่อพนักงาน':<15}{'ยอดขาย(บาท)':>7}{'ระดับผลงาน':<30}")
    print("====================================")
    for d in list:
        print(f'{d.get("name"):<15}{d.get("ยอดขาย"):<12}{d.get("ผลงาน"):<30}')
        
    print("====================================")
    print(f"ยอดรวม {total:>10}")
    print("====================================")

numnum(3)